[Killed] Regex
packages/stub-server/src/openapi-parser.ts:5:25
 import type { ParsedContract, ContractRequest, ContractResponse } from "./contract-parser.js";
 
 /** Matches `{"openapi":` or `{ "swagger":` etc. at the start of JSON content. */
-const JSON_OPENAPI_RE = /^\{\s*"(openapi|swagger)"\s*:/;
+const JSON_OPENAPI_RE = /^\{\s"(openapi|swagger)"\s*:/;
 
 /**
killedBy: looksLikeOpenApi should_return_true_for_json_openapi
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:14:60
  * For JSON content (starts with `{`), requires `"openapi"` or `"swagger"` as the
  * first key at the root level to avoid misidentifying non-OpenAPI JSON.
  */
-export function looksLikeOpenApi(content: string): boolean {
-  let start = 0;
-  while (start < content.length) {
-    const end = content.indexOf("\n", start);
-    const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
-    start = end === -1 ? content.length : end + 1;
-    if (line === "" || line.startsWith("#") || line === "---") continue;
-    if (
-      line.startsWith("openapi") ||
-      line.startsWith("swagger") ||
-      line.startsWith('"openapi"') ||
-      line.startsWith('"swagger"')
-    ) {
-      return true;
-    }
-    if (line.startsWith("{")) {
-      return JSON_OPENAPI_RE.test(content);
-    }
-    return false;
-  }
-  return false;
-}
+export function looksLikeOpenApi(content: string): boolean {}
 
 /**
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:16:10
  */
 export function looksLikeOpenApi(content: string): boolean {
   let start = 0;
-  while (start < content.length) {
+  while (start >= content.length) {
     const end = content.indexOf("\n", start);
     const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:16:10
  */
 export function looksLikeOpenApi(content: string): boolean {
   let start = 0;
-  while (start < content.length) {
+  while (false) {
     const end = content.indexOf("\n", start);
     const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:18:19
   let start = 0;
   while (start < content.length) {
     const end = content.indexOf("\n", start);
-    const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
+    const line = (true ? content.slice(start) : content.slice(start, end)).trim();
     start = end === -1 ? content.length : end + 1;
     if (line === "" || line.startsWith("#") || line === "---") continue;
killedBy: looksLikeOpenApi — edge cases should_return_true_when_yaml_starts_with_document_separator
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
packages/stub-server/src/openapi-parser.ts:18:55
   let start = 0;
   while (start < content.length) {
     const end = content.indexOf("\n", start);
-    const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
+    const line = (end === -1 ? content.slice(start) : content).trim();
     start = end === -1 ? content.length : end + 1;
     if (line === "" || line.startsWith("#") || line === "---") continue;
killedBy: looksLikeOpenApi — edge cases should_return_true_when_yaml_starts_with_document_separator
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:19:13
   while (start < content.length) {
     const end = content.indexOf("\n", start);
     const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
-    start = end === -1 ? content.length : end + 1;
+    start = end !== -1 ? content.length : end + 1;
     if (line === "" || line.startsWith("#") || line === "---") continue;
     if (
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:19:13
   while (start < content.length) {
     const end = content.indexOf("\n", start);
     const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
-    start = end === -1 ? content.length : end + 1;
+    start = true ? content.length : end + 1;
     if (line === "" || line.startsWith("#") || line === "---") continue;
     if (
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:20:9
     const end = content.indexOf("\n", start);
     const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
     start = end === -1 ? content.length : end + 1;
-    if (line === "" || line.startsWith("#") || line === "---") continue;
+    if (true) continue;
     if (
       line.startsWith("openapi") ||
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:20:48
     const end = content.indexOf("\n", start);
     const line = (end === -1 ? content.slice(start) : content.slice(start, end)).trim();
     start = end === -1 ? content.length : end + 1;
-    if (line === "" || line.startsWith("#") || line === "---") continue;
+    if (line === "" || line.startsWith("#") || line !== "---") continue;
     if (
       line.startsWith("openapi") ||
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:22:7
     start = end === -1 ? content.length : end + 1;
     if (line === "" || line.startsWith("#") || line === "---") continue;
     if (
-      line.startsWith("openapi") ||
-      line.startsWith("swagger") ||
-      line.startsWith('"openapi"') ||
-      line.startsWith('"swagger"')
+      (line.startsWith("openapi") || line.startsWith("swagger") || line.startsWith('"openapi"')) && line.startsWith('"swagger"')
     ) {
       return true;
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] MethodExpression
packages/stub-server/src/openapi-parser.ts:22:7
     start = end === -1 ? content.length : end + 1;
     if (line === "" || line.startsWith("#") || line === "---") continue;
     if (
-      line.startsWith("openapi") ||
+      line.endsWith("openapi") ||
       line.startsWith("swagger") ||
       line.startsWith('"openapi"') ||
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] MethodExpression
packages/stub-server/src/openapi-parser.ts:23:7
     if (line === "" || line.startsWith("#") || line === "---") continue;
     if (
       line.startsWith("openapi") ||
-      line.startsWith("swagger") ||
+      line.endsWith("swagger") ||
       line.startsWith('"openapi"') ||
       line.startsWith('"swagger"')
killedBy: looksLikeOpenApi should_return_true_for_swagger_2_yaml
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
packages/stub-server/src/openapi-parser.ts:24:7
     if (
       line.startsWith("openapi") ||
       line.startsWith("swagger") ||
-      line.startsWith('"openapi"') ||
+      line.endsWith('"openapi"') ||
       line.startsWith('"swagger"')
     ) {
killedBy: looksLikeOpenApi should_return_true_for_quoted_openapi_yaml
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
packages/stub-server/src/openapi-parser.ts:25:7
       line.startsWith("openapi") ||
       line.startsWith("swagger") ||
       line.startsWith('"openapi"') ||
-      line.startsWith('"swagger"')
+      line.endsWith('"swagger"')
     ) {
       return true;

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:26:7
       line.startsWith("swagger") ||
       line.startsWith('"openapi"') ||
       line.startsWith('"swagger"')
-    ) {
-      return true;
-    }
+    ) {}
     if (line.startsWith("{")) {
       return JSON_OPENAPI_RE.test(content);
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Contract "openapi.yaml" is missing required "request" field

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:29:9
     ) {
       return true;
     }
-    if (line.startsWith("{")) {
+    if (false) {
       return JSON_OPENAPI_RE.test(content);
     }
killedBy: looksLikeOpenApi should_return_true_for_json_openapi
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
packages/stub-server/src/openapi-parser.ts:29:9
     ) {
       return true;
     }
-    if (line.startsWith("{")) {
+    if (line.endsWith("{")) {
       return JSON_OPENAPI_RE.test(content);
     }
killedBy: looksLikeOpenApi should_return_true_for_json_openapi
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:49:7
   content: string,
 ): readonly ParsedContract[] {
   let doc: unknown;
-  try {
-    doc = yaml.load(content, { schema: yaml.JSON_SCHEMA });
-  } catch (err: unknown) {
+  try {} catch (err: unknown) {
     throw new Error(
       `Failed to parse OpenAPI YAML "${fileName}": ${err instanceof Error ? err.message : String(err)}`,
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:51:26
   let doc: unknown;
   try {
     doc = yaml.load(content, { schema: yaml.JSON_SCHEMA });
-  } catch (err: unknown) {
-    throw new Error(
-      `Failed to parse OpenAPI YAML "${fileName}": ${err instanceof Error ? err.message : String(err)}`,
-    );
-  }
+  } catch (err: unknown) {}
 
   if (typeof doc !== "object" || doc === null) {
killedBy: parseOpenApiContracts — error handling should_throw_on_malformed_yaml
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:57:34
     );
   }
 
-  if (typeof doc !== "object" || doc === null) {
+  if (typeof doc !== "object" || false) {
     return [];
   }
killedBy: parseOpenApiContracts — defensive branches should_return_empty_for_null_yaml
statusReason: Cannot read properties of null (reading 'paths')

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:57:7
     );
   }
 
-  if (typeof doc !== "object" || doc === null) {
+  if (false) {
     return [];
   }
killedBy: parseOpenApiContracts — defensive branches should_return_empty_for_null_yaml
statusReason: Cannot read properties of null (reading 'paths')

[Killed] ArrayDeclaration
packages/stub-server/src/openapi-parser.ts:58:12
   }
 
   if (typeof doc !== "object" || doc === null) {
-    return [];
+    return ["Stryker was here"];
   }
 
killedBy: parseOpenApiContracts — defensive branches should_return_empty_for_null_yaml
statusReason: expected [ 'Stryker was here' ] to have a length of +0 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:63:7
 
   const root = doc as RawOpenApi;
   const paths = root.paths;
-  if (paths === undefined || paths === null || typeof paths !== "object") {
+  if (true) {
     return [];
   }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:63:7
 
   const root = doc as RawOpenApi;
   const paths = root.paths;
-  if (paths === undefined || paths === null || typeof paths !== "object") {
+  if (paths === undefined && paths === null || typeof paths !== "object") {
     return [];
   }
killedBy: parseOpenApiContracts — defensive branches should_return_empty_for_paths_null
statusReason: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
packages/stub-server/src/openapi-parser.ts:64:12
   const root = doc as RawOpenApi;
   const paths = root.paths;
   if (paths === undefined || paths === null || typeof paths !== "object") {
-    return [];
+    return ["Stryker was here"];
   }
 
killedBy: parseOpenApiContracts — defensive branches should_return_empty_for_scalar_yaml
statusReason: expected [ 'Stryker was here' ] to have a length of +0 but got 1

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:70:30
   const contracts: ParsedContract[] = [];
 
   for (const [pathPattern, pathItem] of Object.entries(paths)) {
-    if (pathItem === null || typeof pathItem !== "object") continue;
+    if (pathItem === null || typeof pathItem === "object") continue;
 
     for (const method of HTTP_METHODS) {
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:70:9
   const contracts: ParsedContract[] = [];
 
   for (const [pathPattern, pathItem] of Object.entries(paths)) {
-    if (pathItem === null || typeof pathItem !== "object") continue;
+    if (pathItem === null && typeof pathItem !== "object") continue;
 
     for (const method of HTTP_METHODS) {
killedBy: parseOpenApiContracts — defensive branches should_skip_null_path_items
statusReason: Cannot read properties of null (reading 'get')

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:74:11
 
     for (const method of HTTP_METHODS) {
       const operation = (pathItem as Record<string, unknown>)[method];
-      if (operation === null || typeof operation !== "object") continue;
+      if (operation === null && typeof operation !== "object") continue;
 
       const op = operation as RawOperation;
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Cannot read properties of undefined (reading 'x-contracts')

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:74:11
 
     for (const method of HTTP_METHODS) {
       const operation = (pathItem as Record<string, unknown>)[method];
-      if (operation === null || typeof operation !== "object") continue;
+      if (operation !== null || typeof operation !== "object") continue;
 
       const op = operation as RawOperation;
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:78:11
 
       const op = operation as RawOperation;
       const xContracts = getXContracts(op);
-      if (xContracts.length === 0) continue;
+      if (true) continue;
 
       for (const entry of xContracts) {
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:78:11
 
       const op = operation as RawOperation;
       const xContracts = getXContracts(op);
-      if (xContracts.length === 0) continue;
+      if (xContracts.length !== 0) continue;
 
       for (const entry of xContracts) {
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:80:39
       const xContracts = getXContracts(op);
       if (xContracts.length === 0) continue;
 
-      for (const entry of xContracts) {
-        if (entry.ignored === true) continue;
-
-        const contractId = normalizeContractId(entry.contractId);
-        if (contractId === "") continue;
-
-        const parsed = buildContract(
-          pathPattern,
-          method.toUpperCase(),
-          op,
-          entry,
-          contractId,
-        );
-        if (parsed !== null) {
-          contracts.push(parsed);
-        }
-      }
+      for (const entry of xContracts) {}
     }
   }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:81:13
       if (xContracts.length === 0) continue;
 
       for (const entry of xContracts) {
-        if (entry.ignored === true) continue;
+        if (true) continue;
 
         const contractId = normalizeContractId(entry.contractId);
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:81:13
       if (xContracts.length === 0) continue;
 
       for (const entry of xContracts) {
-        if (entry.ignored === true) continue;
+        if (false) continue;
 
         const contractId = normalizeContractId(entry.contractId);
killedBy: parseOpenApiContracts — ignored contracts should_exclude_contracts_with_ignored_true
statusReason: expected [ { name: 'active', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:84:13
         if (entry.ignored === true) continue;
 
         const contractId = normalizeContractId(entry.contractId);
-        if (contractId === "") continue;
+        if (contractId !== "") continue;
 
         const parsed = buildContract(
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:84:13
         if (entry.ignored === true) continue;
 
         const contractId = normalizeContractId(entry.contractId);
-        if (contractId === "") continue;
+        if (true) continue;
 
         const parsed = buildContract(
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] MethodExpression
packages/stub-server/src/openapi-parser.ts:88:11
 
         const parsed = buildContract(
           pathPattern,
-          method.toUpperCase(),
+          method.toLowerCase(),
           op,
           entry,
killedBy: loadFromDirectory openapi format should_produce_multiple_contracts_from_one_openapi_file
statusReason: expected 'get' to be 'GET' // Object.is equality

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:93:30
           entry,
           contractId,
         );
-        if (parsed !== null) {
-          contracts.push(parsed);
-        }
+        if (parsed !== null) {}
       }
     }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:93:13
           entry,
           contractId,
         );
-        if (parsed !== null) {
+        if (true) {
           contracts.push(parsed);
         }
killedBy: parseOpenApiContracts — defensive branches should_skip_non_numeric_response_keys
statusReason: expected [ null ] to have a length of +0 but got 1

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:117:7
 
   // Resolve response
   const responseMatch = findResponse(operation, contractId);
-  if (responseMatch === null) return null;
+  if (responseMatch !== null) return null;
 
   const { statusCode, xContract: responseXContract } = responseMatch;
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:117:7
 
   // Resolve response
   const responseMatch = findResponse(operation, contractId);
-  if (responseMatch === null) return null;
+  if (false) return null;
 
   const { statusCode, xContract: responseXContract } = responseMatch;
killedBy: parseOpenApiContracts — defensive branches should_skip_non_numeric_response_keys
statusReason: Cannot destructure property 'statusCode' of 'responseMatch' as it is null.

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:129:5
 
   // Contract name
   const name =
-    typeof entry.name === "string" && entry.name !== ""
+    true
       ? entry.name
       : `${httpMethod} ${pathPattern} #${String(contractId)}`;
killedBy: parseOpenApiContracts — error handling should_fallback_name_to_method_path_contractId
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:129:5
 
   // Contract name
   const name =
-    typeof entry.name === "string" && entry.name !== ""
+    true && entry.name !== ""
       ? entry.name
       : `${httpMethod} ${pathPattern} #${String(contractId)}`;
killedBy: parseOpenApiContracts — error handling should_fallback_name_to_method_path_contractId
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:137:9
     name,
     request,
     response,
-    ...(typeof entry.priority === "number" ? { priority: entry.priority } : {}),
+    ...(typeof entry.priority !== "number" ? { priority: entry.priority } : {}),
   };
 }
killedBy: parseOpenApiContracts — priority should_set_priority_from_x_contracts
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:137:9
     name,
     request,
     response,
-    ...(typeof entry.priority === "number" ? { priority: entry.priority } : {}),
+    ...(false ? { priority: entry.priority } : {}),
   };
 }
killedBy: parseOpenApiContracts — priority should_set_priority_from_x_contracts
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:148:7
   contractId: string,
 ): string {
   // contractPath override
-  if (typeof entry.contractPath === "string" && entry.contractPath !== "") {
+  if (true) {
     return entry.contractPath;
   }
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected undefined to be '/users/123' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:148:7
   contractId: string,
 ): string {
   // contractPath override
-  if (typeof entry.contractPath === "string" && entry.contractPath !== "") {
+  if (true && entry.contractPath !== "") {
     return entry.contractPath;
   }
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected undefined to be '/users/123' // Object.is equality

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:154:22
 
   // Replace {param} placeholders with x-contracts values
   let resolved = pathPattern;
-  const parameters = operation.parameters ?? [];
+  const parameters = operation.parameters && [];
 
   for (const param of parameters) {
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: parameters is not iterable

[Survived] ArrayDeclaration
packages/stub-server/src/openapi-parser.ts:154:46
 
   // Replace {param} placeholders with x-contracts values
   let resolved = pathPattern;
-  const parameters = operation.parameters ?? [];
+  const parameters = operation.parameters ?? ["Stryker was here"];
 
   for (const param of parameters) {

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:156:35
   let resolved = pathPattern;
   const parameters = operation.parameters ?? [];
 
-  for (const param of parameters) {
-    if (param === null || typeof param !== "object") continue;
-    if (param.in !== "path") continue;
-
-    const paramName = param.name;
-    if (typeof paramName !== "string") continue;
-
-    const paramXContracts = getXContracts(param);
-    const matching = paramXContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
-    );
-    if (matching !== undefined && matching.value !== undefined) {
-      resolved = resolved.split(`{${paramName}}`).join(String(matching.value));
-    }
-  }
+  for (const param of parameters) {}
 
   const unresolved = resolved.match(/\{[^}]+\}/g);
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:157:9
   const parameters = operation.parameters ?? [];
 
   for (const param of parameters) {
-    if (param === null || typeof param !== "object") continue;
+    if (param !== null || typeof param !== "object") continue;
     if (param.in !== "path") continue;
 
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:157:27
   const parameters = operation.parameters ?? [];
 
   for (const param of parameters) {
-    if (param === null || typeof param !== "object") continue;
+    if (param === null || typeof param === "object") continue;
     if (param.in !== "path") continue;
 
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:158:9
 
   for (const param of parameters) {
     if (param === null || typeof param !== "object") continue;
-    if (param.in !== "path") continue;
+    if (true) continue;
 
     const paramName = param.name;
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:158:9
 
   for (const param of parameters) {
     if (param === null || typeof param !== "object") continue;
-    if (param.in !== "path") continue;
+    if (param.in === "path") continue;
 
     const paramName = param.name;
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:161:9
     if (param.in !== "path") continue;
 
     const paramName = param.name;
-    if (typeof paramName !== "string") continue;
+    if (true) continue;
 
     const paramXContracts = getXContracts(param);
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:161:9
     if (param.in !== "path") continue;
 
     const paramName = param.name;
-    if (typeof paramName !== "string") continue;
+    if (typeof paramName === "string") continue;
 
     const paramXContracts = getXContracts(param);
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality
