[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:165:14
 
     const paramXContracts = getXContracts(param);
     const matching = paramXContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
+      (x) => normalizeContractId(x.contractId) !== contractId,
     );
     if (matching !== undefined && matching.value !== undefined) {
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:165:14
 
     const paramXContracts = getXContracts(param);
     const matching = paramXContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
+      (x) => false,
     );
     if (matching !== undefined && matching.value !== undefined) {
killedBy: parseOpenApiContracts — path parameter substitution should_replace_path_parameter_placeholders_with_x_contracts_values
statusReason: expected '/users/{id}' to be '/users/123' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:167:9
     const matching = paramXContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching !== undefined && matching.value !== undefined) {
+    if (true) {
       resolved = resolved.split(`{${paramName}}`).join(String(matching.value));
     }
killedBy: parseOpenApiContracts — defensive branches should_handle_path_param_with_no_matching_x_contracts_value
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:167:9
     const matching = paramXContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching !== undefined && matching.value !== undefined) {
+    if (true && matching.value !== undefined) {
       resolved = resolved.split(`{${paramName}}`).join(String(matching.value));
     }
killedBy: parseOpenApiContracts — defensive branches should_handle_path_param_with_no_matching_x_contracts_value
statusReason: Cannot read properties of undefined (reading 'value')

[Survived] Regex
packages/stub-server/src/openapi-parser.ts:172:37
     }
   }
 
-  const unresolved = resolved.match(/\{[^}]+\}/g);
+  const unresolved = resolved.match(/\{[^}]\}/g);
   if (unresolved !== null && unresolved.length > 0) {
     console.warn(

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:173:7
   }
 
   const unresolved = resolved.match(/\{[^}]+\}/g);
-  if (unresolved !== null && unresolved.length > 0) {
+  if (unresolved !== null || unresolved.length > 0) {
     console.warn(
       `[openapi-parser] Unresolved path parameters in "${pathPattern}" for contractId=${contractId}: ${unresolved.join(", ")}`,
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:173:7
   }
 
   const unresolved = resolved.match(/\{[^}]+\}/g);
-  if (unresolved !== null && unresolved.length > 0) {
+  if (true) {
     console.warn(
       `[openapi-parser] Unresolved path parameters in "${pathPattern}" for contractId=${contractId}: ${unresolved.join(", ")}`,
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Cannot read properties of null (reading 'join')

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:194:73
   let body: unknown = undefined;
 
   // Headers from operation-level x-contracts
-  if (entry.headers !== undefined && typeof entry.headers === "object") {
-    for (const [key, value] of Object.entries(entry.headers as Record<string, unknown>)) {
-      if (typeof value === "string") {
-        headers[key] = value;
-      }
-    }
-  }
+  if (entry.headers !== undefined && typeof entry.headers === "object") {}
 
   // Parameters (query + header)
killedBy: parseOpenApiContracts — request headers should_merge_headers_from_operation_x_contracts
statusReason: expected undefined to deeply equal { Accept: 'application/json', …(1) }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:194:7
   let body: unknown = undefined;
 
   // Headers from operation-level x-contracts
-  if (entry.headers !== undefined && typeof entry.headers === "object") {
+  if (false) {
     for (const [key, value] of Object.entries(entry.headers as Record<string, unknown>)) {
       if (typeof value === "string") {
killedBy: parseOpenApiContracts — request headers should_merge_headers_from_operation_x_contracts
statusReason: expected undefined to deeply equal { Accept: 'application/json', …(1) }

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:195:90
 
   // Headers from operation-level x-contracts
   if (entry.headers !== undefined && typeof entry.headers === "object") {
-    for (const [key, value] of Object.entries(entry.headers as Record<string, unknown>)) {
-      if (typeof value === "string") {
-        headers[key] = value;
-      }
-    }
+    for (const [key, value] of Object.entries(entry.headers as Record<string, unknown>)) {}
   }
 
killedBy: parseOpenApiContracts — request headers should_merge_headers_from_operation_x_contracts
statusReason: expected undefined to deeply equal { Accept: 'application/json', …(1) }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:196:11
   // Headers from operation-level x-contracts
   if (entry.headers !== undefined && typeof entry.headers === "object") {
     for (const [key, value] of Object.entries(entry.headers as Record<string, unknown>)) {
-      if (typeof value === "string") {
+      if (true) {
         headers[key] = value;
       }
killedBy: parseOpenApiContracts — defensive branches should_skip_non_string_header_values
statusReason: expected { 'X-Valid': 'value', 'X-Number': 42 } to deeply equal { 'X-Valid': 'value' }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:196:11
   // Headers from operation-level x-contracts
   if (entry.headers !== undefined && typeof entry.headers === "object") {
     for (const [key, value] of Object.entries(entry.headers as Record<string, unknown>)) {
-      if (typeof value === "string") {
+      if (false) {
         headers[key] = value;
       }
killedBy: parseOpenApiContracts — request headers should_merge_headers_from_operation_x_contracts
statusReason: expected undefined to deeply equal { Accept: 'application/json', …(1) }

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:203:22
   }
 
   // Parameters (query + header)
-  const parameters = operation.parameters ?? [];
+  const parameters = operation.parameters && [];
   for (const param of parameters) {
     if (param === null || typeof param !== "object") continue;
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: parameters is not iterable

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:204:35
 
   // Parameters (query + header)
   const parameters = operation.parameters ?? [];
-  for (const param of parameters) {
-    if (param === null || typeof param !== "object") continue;
-
-    const paramXContracts = getXContracts(param);
-    const matching = paramXContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
-    );
-    if (matching === undefined || matching.value === undefined) continue;
-
-    if (param.in === "query" && typeof param.name === "string") {
-      queryParameters[param.name] = String(matching.value);
-    } else if (param.in === "header" && typeof param.name === "string") {
-      headers[param.name] = String(matching.value);
-    }
-  }
+  for (const param of parameters) {}
 
   // Request body
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:205:9
   // Parameters (query + header)
   const parameters = operation.parameters ?? [];
   for (const param of parameters) {
-    if (param === null || typeof param !== "object") continue;
+    if (true) continue;
 
     const paramXContracts = getXContracts(param);
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:209:14
 
     const paramXContracts = getXContracts(param);
     const matching = paramXContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
+      (x) => true,
     );
     if (matching === undefined || matching.value === undefined) continue;
killedBy: parseOpenApiContracts — multiple contracts per operation should_set_correct_query_parameter_per_contract
statusReason: expected { date: '2022-04-13' } to deeply equal { date: 'invalid-date' }

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:211:35
     const matching = paramXContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching === undefined || matching.value === undefined) continue;
+    if (matching === undefined || matching.value !== undefined) continue;
 
     if (param.in === "query" && typeof param.name === "string") {
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:211:9
     const matching = paramXContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching === undefined || matching.value === undefined) continue;
+    if (true) continue;
 
     if (param.in === "query" && typeof param.name === "string") {
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:213:65
     );
     if (matching === undefined || matching.value === undefined) continue;
 
-    if (param.in === "query" && typeof param.name === "string") {
-      queryParameters[param.name] = String(matching.value);
-    } else if (param.in === "header" && typeof param.name === "string") {
+    if (param.in === "query" && typeof param.name === "string") {} else if (param.in === "header" && typeof param.name === "string") {
       headers[param.name] = String(matching.value);
     }
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:213:33
     );
     if (matching === undefined || matching.value === undefined) continue;
 
-    if (param.in === "query" && typeof param.name === "string") {
+    if (param.in === "query" && typeof param.name !== "string") {
       queryParameters[param.name] = String(matching.value);
     } else if (param.in === "header" && typeof param.name === "string") {
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:215:41
 
     if (param.in === "query" && typeof param.name === "string") {
       queryParameters[param.name] = String(matching.value);
-    } else if (param.in === "header" && typeof param.name === "string") {
+    } else if (param.in === "header" && typeof param.name !== "string") {
       headers[param.name] = String(matching.value);
     }
killedBy: parseOpenApiContracts — request headers should_include_header_parameters_from_x_contracts
statusReason: expected undefined to be 'trace-abc' // Object.is equality

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:215:73
 
     if (param.in === "query" && typeof param.name === "string") {
       queryParameters[param.name] = String(matching.value);
-    } else if (param.in === "header" && typeof param.name === "string") {
-      headers[param.name] = String(matching.value);
-    }
+    } else if (param.in === "header" && typeof param.name === "string") {}
   }
 
killedBy: parseOpenApiContracts — request headers should_include_header_parameters_from_x_contracts
statusReason: expected undefined to be 'trace-abc' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:222:7
 
   // Request body
   const requestBody = operation.requestBody;
-  if (requestBody !== undefined && requestBody !== null && typeof requestBody === "object") {
+  if (false) {
     // Content type from requestBody.content
     const rbContent = (requestBody as Record<string, unknown>).content;
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to deeply equal { name: 'John', …(1) }

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:222:7
 
   // Request body
   const requestBody = operation.requestBody;
-  if (requestBody !== undefined && requestBody !== null && typeof requestBody === "object") {
+  if (requestBody === undefined && requestBody !== null && typeof requestBody === "object") {
     // Content type from requestBody.content
     const rbContent = (requestBody as Record<string, unknown>).content;
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to deeply equal { name: 'John', …(1) }

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:225:89
   if (requestBody !== undefined && requestBody !== null && typeof requestBody === "object") {
     // Content type from requestBody.content
     const rbContent = (requestBody as Record<string, unknown>).content;
-    if (rbContent !== undefined && rbContent !== null && typeof rbContent === "object") {
-      const mediaTypes = Object.keys(rbContent as Record<string, unknown>);
-      const firstMediaType = mediaTypes[0];
-      if (firstMediaType !== undefined && headers["Content-Type"] === undefined) {
-        headers["Content-Type"] = firstMediaType;
-      }
-    }
+    if (rbContent !== undefined && rbContent !== null && typeof rbContent === "object") {}
 
     // Body from requestBody x-contracts
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to be 'application/json' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:225:9
   if (requestBody !== undefined && requestBody !== null && typeof requestBody === "object") {
     // Content type from requestBody.content
     const rbContent = (requestBody as Record<string, unknown>).content;
-    if (rbContent !== undefined && rbContent !== null && typeof rbContent === "object") {
+    if (false) {
       const mediaTypes = Object.keys(rbContent as Record<string, unknown>);
       const firstMediaType = mediaTypes[0];
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to be 'application/json' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:228:43
     if (rbContent !== undefined && rbContent !== null && typeof rbContent === "object") {
       const mediaTypes = Object.keys(rbContent as Record<string, unknown>);
       const firstMediaType = mediaTypes[0];
-      if (firstMediaType !== undefined && headers["Content-Type"] === undefined) {
+      if (firstMediaType !== undefined && headers["Content-Type"] !== undefined) {
         headers["Content-Type"] = firstMediaType;
       }
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to be 'application/json' // Object.is equality

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:228:11
     if (rbContent !== undefined && rbContent !== null && typeof rbContent === "object") {
       const mediaTypes = Object.keys(rbContent as Record<string, unknown>);
       const firstMediaType = mediaTypes[0];
-      if (firstMediaType !== undefined && headers["Content-Type"] === undefined) {
+      if (firstMediaType !== undefined || headers["Content-Type"] === undefined) {
         headers["Content-Type"] = firstMediaType;
       }
killedBy: parseOpenApiContracts — defensive branches should_not_override_explicit_content_type_header_with_media_type
statusReason: expected 'application/json' to be 'text/custom' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:236:14
     // Body from requestBody x-contracts
     const rbXContracts = getXContracts(requestBody as HasExtensions);
     const matching = rbXContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
+      (x) => normalizeContractId(x.contractId) !== contractId,
     );
     if (matching !== undefined && matching.body !== undefined) {
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to deeply equal { name: 'John', …(1) }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:236:14
     // Body from requestBody x-contracts
     const rbXContracts = getXContracts(requestBody as HasExtensions);
     const matching = rbXContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
+      (x) => false,
     );
     if (matching !== undefined && matching.body !== undefined) {
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to deeply equal { name: 'John', …(1) }

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:238:9
     const matching = rbXContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching !== undefined && matching.body !== undefined) {
+    if (matching !== undefined || matching.body !== undefined) {
       body = matching.body;
     }
killedBy: parseOpenApiContracts — defensive branches should_handle_request_body_without_content
statusReason: Cannot read properties of undefined (reading 'body')

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:238:9
     const matching = rbXContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching !== undefined && matching.body !== undefined) {
+    if (matching === undefined && matching.body !== undefined) {
       body = matching.body;
     }
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to deeply equal { name: 'John', …(1) }

[Killed] ObjectLiteral
packages/stub-server/src/openapi-parser.ts:243:35
     }
   }
 
-  const result: ContractRequest = {
-    method: httpMethod,
-    urlPath,
-    ...(Object.keys(headers).length > 0 ? { headers } : {}),
-    ...(Object.keys(queryParameters).length > 0 ? { queryParameters } : {}),
-    ...(body !== undefined ? { body } : {}),
-  };
+  const result: ContractRequest = {};
 
   return result;
killedBy: loadFromDirectory openapi format should_produce_multiple_contracts_from_one_openapi_file
statusReason: expected undefined to be 'GET' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:246:9
   const result: ContractRequest = {
     method: httpMethod,
     urlPath,
-    ...(Object.keys(headers).length > 0 ? { headers } : {}),
+    ...(false ? { headers } : {}),
     ...(Object.keys(queryParameters).length > 0 ? { queryParameters } : {}),
     ...(body !== undefined ? { body } : {}),
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to be 'application/json' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:246:9
   const result: ContractRequest = {
     method: httpMethod,
     urlPath,
-    ...(Object.keys(headers).length > 0 ? { headers } : {}),
+    ...(Object.keys(headers).length >= 0 ? { headers } : {}),
     ...(Object.keys(queryParameters).length > 0 ? { queryParameters } : {}),
     ...(body !== undefined ? { body } : {}),
killedBy: parseOpenApiContracts — defensive branches should_handle_request_body_without_content
statusReason: expected {} to be undefined

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:247:9
     method: httpMethod,
     urlPath,
     ...(Object.keys(headers).length > 0 ? { headers } : {}),
-    ...(Object.keys(queryParameters).length > 0 ? { queryParameters } : {}),
+    ...(false ? { queryParameters } : {}),
     ...(body !== undefined ? { body } : {}),
   };
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:247:9
     method: httpMethod,
     urlPath,
     ...(Object.keys(headers).length > 0 ? { headers } : {}),
-    ...(Object.keys(queryParameters).length > 0 ? { queryParameters } : {}),
+    ...(Object.keys(queryParameters).length <= 0 ? { queryParameters } : {}),
     ...(body !== undefined ? { body } : {}),
   };
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13' }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:248:9
     urlPath,
     ...(Object.keys(headers).length > 0 ? { headers } : {}),
     ...(Object.keys(queryParameters).length > 0 ? { queryParameters } : {}),
-    ...(body !== undefined ? { body } : {}),
+    ...(false ? { body } : {}),
   };
 
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to deeply equal { name: 'John', …(1) }

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:248:9
     urlPath,
     ...(Object.keys(headers).length > 0 ? { headers } : {}),
     ...(Object.keys(queryParameters).length > 0 ? { queryParameters } : {}),
-    ...(body !== undefined ? { body } : {}),
+    ...(body === undefined ? { body } : {}),
   };
 
killedBy: parseOpenApiContracts — POST with request body should_parse_POST_with_body_and_content_type
statusReason: expected undefined to deeply equal { name: 'John', …(1) }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:263:5
 
   // Headers from response x-contracts
   if (
-    responseXContract.headers !== undefined &&
-    typeof responseXContract.headers === "object"
+    true
   ) {
     for (const [key, value] of Object.entries(
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Cannot convert undefined or null to object

[Survived] EqualityOperator
packages/stub-server/src/openapi-parser.ts:263:5
 
   // Headers from response x-contracts
   if (
-    responseXContract.headers !== undefined &&
+    responseXContract.headers === undefined &&
     typeof responseXContract.headers === "object"
   ) {

[Survived] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:264:5
   // Headers from response x-contracts
   if (
     responseXContract.headers !== undefined &&
-    typeof responseXContract.headers === "object"
+    true
   ) {
     for (const [key, value] of Object.entries(

[Survived] EqualityOperator
packages/stub-server/src/openapi-parser.ts:264:5
   // Headers from response x-contracts
   if (
     responseXContract.headers !== undefined &&
-    typeof responseXContract.headers === "object"
+    typeof responseXContract.headers !== "object"
   ) {
     for (const [key, value] of Object.entries(

[Survived] BlockStatement
packages/stub-server/src/openapi-parser.ts:265:5
   if (
     responseXContract.headers !== undefined &&
     typeof responseXContract.headers === "object"
-  ) {
-    for (const [key, value] of Object.entries(
-      responseXContract.headers as Record<string, unknown>,
-    )) {
-      if (typeof value === "string") {
-        headers[key] = value;
-      }
-    }
-  }
+  ) {}
 
   // If no Content-Type in x-contracts headers, derive from response content media type

[Survived] BlockStatement
packages/stub-server/src/openapi-parser.ts:268:8
   ) {
     for (const [key, value] of Object.entries(
       responseXContract.headers as Record<string, unknown>,
-    )) {
-      if (typeof value === "string") {
-        headers[key] = value;
-      }
-    }
+    )) {}
   }
 

[Survived] EqualityOperator
packages/stub-server/src/openapi-parser.ts:269:11
     for (const [key, value] of Object.entries(
       responseXContract.headers as Record<string, unknown>,
     )) {
-      if (typeof value === "string") {
+      if (typeof value !== "string") {
         headers[key] = value;
       }

[Survived] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:269:11
     for (const [key, value] of Object.entries(
       responseXContract.headers as Record<string, unknown>,
     )) {
-      if (typeof value === "string") {
+      if (true) {
         headers[key] = value;
       }

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:276:46
   }
 
   // If no Content-Type in x-contracts headers, derive from response content media type
-  if (headers["Content-Type"] === undefined) {
-    const responses = operation.responses ?? {};
-    const statusKey = String(statusCode);
-    const responseObj = responses[statusKey];
-    if (
-      responseObj !== undefined &&
-      responseObj !== null &&
-      typeof responseObj === "object"
-    ) {
-      const content = (responseObj as Record<string, unknown>).content;
-      if (content !== undefined && content !== null && typeof content === "object") {
-        const mediaTypes = Object.keys(content as Record<string, unknown>);
-        const firstMediaType = mediaTypes[0];
-        if (firstMediaType !== undefined) {
-          headers["Content-Type"] = firstMediaType;
-        }
-      }
-    }
-  }
+  if (headers["Content-Type"] === undefined) {}
 
   return {
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:276:7
   }
 
   // If no Content-Type in x-contracts headers, derive from response content media type
-  if (headers["Content-Type"] === undefined) {
+  if (false) {
     const responses = operation.responses ?? {};
     const statusKey = String(statusCode);
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:277:23
 
   // If no Content-Type in x-contracts headers, derive from response content media type
   if (headers["Content-Type"] === undefined) {
-    const responses = operation.responses ?? {};
+    const responses = operation.responses && {};
     const statusKey = String(statusCode);
     const responseObj = responses[statusKey];
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:281:7
     const statusKey = String(statusCode);
     const responseObj = responses[statusKey];
     if (
-      responseObj !== undefined &&
+      responseObj === undefined &&
       responseObj !== null &&
       typeof responseObj === "object"
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:281:7
     const statusKey = String(statusCode);
     const responseObj = responses[statusKey];
     if (
-      responseObj !== undefined &&
-      responseObj !== null &&
-      typeof responseObj === "object"
+      false
     ) {
       const content = (responseObj as Record<string, unknown>).content;
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:282:7
     const responseObj = responses[statusKey];
     if (
       responseObj !== undefined &&
-      responseObj !== null &&
+      responseObj === null &&
       typeof responseObj === "object"
     ) {
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality
