[Survived] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:282:7
     const responseObj = responses[statusKey];
     if (
       responseObj !== undefined &&
-      responseObj !== null &&
+      true &&
       typeof responseObj === "object"
     ) {

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:283:7
     if (
       responseObj !== undefined &&
       responseObj !== null &&
-      typeof responseObj === "object"
+      typeof responseObj !== "object"
     ) {
       const content = (responseObj as Record<string, unknown>).content;
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Survived] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:283:7
     if (
       responseObj !== undefined &&
       responseObj !== null &&
-      typeof responseObj === "object"
+      true
     ) {
       const content = (responseObj as Record<string, unknown>).content;

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:284:7
       responseObj !== undefined &&
       responseObj !== null &&
       typeof responseObj === "object"
-    ) {
-      const content = (responseObj as Record<string, unknown>).content;
-      if (content !== undefined && content !== null && typeof content === "object") {
-        const mediaTypes = Object.keys(content as Record<string, unknown>);
-        const firstMediaType = mediaTypes[0];
-        if (firstMediaType !== undefined) {
-          headers["Content-Type"] = firstMediaType;
-        }
-      }
-    }
+    ) {}
   }
 
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:286:11
       typeof responseObj === "object"
     ) {
       const content = (responseObj as Record<string, unknown>).content;
-      if (content !== undefined && content !== null && typeof content === "object") {
+      if (false) {
         const mediaTypes = Object.keys(content as Record<string, unknown>);
         const firstMediaType = mediaTypes[0];
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:286:85
       typeof responseObj === "object"
     ) {
       const content = (responseObj as Record<string, unknown>).content;
-      if (content !== undefined && content !== null && typeof content === "object") {
-        const mediaTypes = Object.keys(content as Record<string, unknown>);
-        const firstMediaType = mediaTypes[0];
-        if (firstMediaType !== undefined) {
-          headers["Content-Type"] = firstMediaType;
-        }
-      }
+      if (content !== undefined && content !== null && typeof content === "object") {}
     }
   }
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:289:13
       if (content !== undefined && content !== null && typeof content === "object") {
         const mediaTypes = Object.keys(content as Record<string, unknown>);
         const firstMediaType = mediaTypes[0];
-        if (firstMediaType !== undefined) {
+        if (firstMediaType === undefined) {
           headers["Content-Type"] = firstMediaType;
         }
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:289:43
       if (content !== undefined && content !== null && typeof content === "object") {
         const mediaTypes = Object.keys(content as Record<string, unknown>);
         const firstMediaType = mediaTypes[0];
-        if (firstMediaType !== undefined) {
-          headers["Content-Type"] = firstMediaType;
-        }
+        if (firstMediaType !== undefined) {}
       }
     }
killedBy: parseOpenApiContracts — defensive branches should_derive_content_type_from_response_media_when_x_contracts_headers_absent
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] ObjectLiteral
packages/stub-server/src/openapi-parser.ts:296:10
     }
   }
 
-  return {
-    status: statusCode,
-    ...(Object.keys(headers).length > 0 ? { headers } : {}),
-    ...(responseXContract.body !== undefined ? { body: responseXContract.body } : {}),
-  };
+  return {};
 }
 
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:298:9
 
   return {
     status: statusCode,
-    ...(Object.keys(headers).length > 0 ? { headers } : {}),
+    ...(true ? { headers } : {}),
     ...(responseXContract.body !== undefined ? { body: responseXContract.body } : {}),
   };
killedBy: parseOpenApiContracts — defensive branches should_handle_response_without_content_for_content_type
statusReason: expected {} to be undefined

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:298:9
 
   return {
     status: statusCode,
-    ...(Object.keys(headers).length > 0 ? { headers } : {}),
+    ...(Object.keys(headers).length >= 0 ? { headers } : {}),
     ...(responseXContract.body !== undefined ? { body: responseXContract.body } : {}),
   };
killedBy: parseOpenApiContracts — defensive branches should_handle_response_without_content_for_content_type
statusReason: expected {} to be undefined

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:299:9
   return {
     status: statusCode,
     ...(Object.keys(headers).length > 0 ? { headers } : {}),
-    ...(responseXContract.body !== undefined ? { body: responseXContract.body } : {}),
+    ...(responseXContract.body === undefined ? { body: responseXContract.body } : {}),
   };
 }
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13', …(1) }

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:299:9
   return {
     status: statusCode,
     ...(Object.keys(headers).length > 0 ? { headers } : {}),
-    ...(responseXContract.body !== undefined ? { body: responseXContract.body } : {}),
+    ...(false ? { body: responseXContract.body } : {}),
   };
 }
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: expected undefined to deeply equal { date: '2022-04-13', …(1) }

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:306:61
 function findResponse(
   operation: RawOperation,
   contractId: string,
-): { statusCode: number; xContract: XContractEntry } | null {
-  const responses = operation.responses ?? {};
-
-  for (const [statusKey, responseObj] of Object.entries(responses)) {
-    const code = parseInt(statusKey, 10);
-    if (isNaN(code)) continue;
-
-    if (responseObj === null || typeof responseObj !== "object") continue;
-
-    const xContracts = getXContracts(responseObj as HasExtensions);
-    const matching = xContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
-    );
-    if (matching !== undefined) {
-      return { statusCode: code, xContract: matching };
-    }
-  }
-
-  return null;
-}
+): { statusCode: number; xContract: XContractEntry } | null {}
 
 function getXContracts(obj: HasExtensions): readonly XContractEntry[] {
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Cannot destructure property 'statusCode' of 'responseMatch' as it is undefined.

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:307:21
   operation: RawOperation,
   contractId: string,
 ): { statusCode: number; xContract: XContractEntry } | null {
-  const responses = operation.responses ?? {};
+  const responses = operation.responses && {};
 
   for (const [statusKey, responseObj] of Object.entries(responses)) {
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:309:69
 ): { statusCode: number; xContract: XContractEntry } | null {
   const responses = operation.responses ?? {};
 
-  for (const [statusKey, responseObj] of Object.entries(responses)) {
-    const code = parseInt(statusKey, 10);
-    if (isNaN(code)) continue;
-
-    if (responseObj === null || typeof responseObj !== "object") continue;
-
-    const xContracts = getXContracts(responseObj as HasExtensions);
-    const matching = xContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
-    );
-    if (matching !== undefined) {
-      return { statusCode: code, xContract: matching };
-    }
-  }
+  for (const [statusKey, responseObj] of Object.entries(responses)) {}
 
   return null;
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:311:9
 
   for (const [statusKey, responseObj] of Object.entries(responses)) {
     const code = parseInt(statusKey, 10);
-    if (isNaN(code)) continue;
+    if (false) continue;
 
     if (responseObj === null || typeof responseObj !== "object") continue;
killedBy: parseOpenApiContracts — defensive branches should_skip_non_numeric_response_keys
statusReason: expected [ { name: 'GET /test #1', …(2) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:311:9
 
   for (const [statusKey, responseObj] of Object.entries(responses)) {
     const code = parseInt(statusKey, 10);
-    if (isNaN(code)) continue;
+    if (true) continue;
 
     if (responseObj === null || typeof responseObj !== "object") continue;
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:313:9
     const code = parseInt(statusKey, 10);
     if (isNaN(code)) continue;
 
-    if (responseObj === null || typeof responseObj !== "object") continue;
+    if (true) continue;
 
     const xContracts = getXContracts(responseObj as HasExtensions);
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:313:33
     const code = parseInt(statusKey, 10);
     if (isNaN(code)) continue;
 
-    if (responseObj === null || typeof responseObj !== "object") continue;
+    if (responseObj === null || typeof responseObj === "object") continue;
 
     const xContracts = getXContracts(responseObj as HasExtensions);
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:317:14
 
     const xContracts = getXContracts(responseObj as HasExtensions);
     const matching = xContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
+      (x) => false,
     );
     if (matching !== undefined) {
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:317:14
 
     const xContracts = getXContracts(responseObj as HasExtensions);
     const matching = xContracts.find(
-      (x) => normalizeContractId(x.contractId) === contractId,
+      (x) => true,
     );
     if (matching !== undefined) {
killedBy: parseOpenApiContracts — multiple contracts per operation should_produce_three_contracts_from_three_x_contracts_entries
statusReason: expected [ 200, 200, 200 ] to deeply equal [ 200, 400, 500 ]

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:319:9
     const matching = xContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching !== undefined) {
+    if (false) {
       return { statusCode: code, xContract: matching };
     }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:319:9
     const matching = xContracts.find(
       (x) => normalizeContractId(x.contractId) === contractId,
     );
-    if (matching !== undefined) {
+    if (true) {
       return { statusCode: code, xContract: matching };
     }
killedBy: parseOpenApiContracts — basic GET conversion should_parse_GET_with_query_parameter_and_response_body
statusReason: Cannot read properties of undefined (reading 'headers')

[Killed] ObjectLiteral
packages/stub-server/src/openapi-parser.ts:320:14
       (x) => normalizeContractId(x.contractId) === contractId,
     );
     if (matching !== undefined) {
-      return { statusCode: code, xContract: matching };
+      return {};
     }
   }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Cannot read properties of undefined (reading 'headers')

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:327:71
   return null;
 }
 
-function getXContracts(obj: HasExtensions): readonly XContractEntry[] {
-  const raw = obj["x-contracts"];
-  if (!Array.isArray(raw)) return [];
-  return raw.filter(
-    (el): el is XContractEntry => typeof el === "object" && el !== null,
-  );
-}
+function getXContracts(obj: HasExtensions): readonly XContractEntry[] {}
 
 /** Normalize contractId to string for consistent comparison across YAML types. */
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:329:7
 
 function getXContracts(obj: HasExtensions): readonly XContractEntry[] {
   const raw = obj["x-contracts"];
-  if (!Array.isArray(raw)) return [];
+  if (false) return [];
   return raw.filter(
     (el): el is XContractEntry => typeof el === "object" && el !== null,
killedBy: parseOpenApiContracts — no x-contracts should_return_empty_when_no_x_contracts_present
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:329:7
 
 function getXContracts(obj: HasExtensions): readonly XContractEntry[] {
   const raw = obj["x-contracts"];
-  if (!Array.isArray(raw)) return [];
+  if (true) return [];
   return raw.filter(
     (el): el is XContractEntry => typeof el === "object" && el !== null,
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] MethodExpression
packages/stub-server/src/openapi-parser.ts:330:10
 function getXContracts(obj: HasExtensions): readonly XContractEntry[] {
   const raw = obj["x-contracts"];
   if (!Array.isArray(raw)) return [];
-  return raw.filter(
-    (el): el is XContractEntry => typeof el === "object" && el !== null,
-  );
+  return raw;
 }
 
killedBy: parseOpenApiContracts — null safety should_skip_null_elements_in_x_contracts_array
statusReason: Cannot read properties of null (reading 'ignored')

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:331:35
   const raw = obj["x-contracts"];
   if (!Array.isArray(raw)) return [];
   return raw.filter(
-    (el): el is XContractEntry => typeof el === "object" && el !== null,
+    (el): el is XContractEntry => typeof el === "object" || el !== null,
   );
 }
killedBy: parseOpenApiContracts — null safety should_skip_null_elements_in_x_contracts_array
statusReason: Cannot read properties of null (reading 'ignored')

[Killed] ConditionalExpression
packages/stub-server/src/openapi-parser.ts:331:35
   const raw = obj["x-contracts"];
   if (!Array.isArray(raw)) return [];
   return raw.filter(
-    (el): el is XContractEntry => typeof el === "object" && el !== null,
+    (el): el is XContractEntry => false,
   );
 }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] BlockStatement
packages/stub-server/src/openapi-parser.ts:336:51
 }
 
 /** Normalize contractId to string for consistent comparison across YAML types. */
-function normalizeContractId(id: unknown): string {
-  if (id === undefined || id === null) return "";
-  if (typeof id === "string" || typeof id === "number" || typeof id === "boolean") {
-    return String(id);
-  }
-  return "";
-}
+function normalizeContractId(id: unknown): string {}
 
 // Raw types for the parsed YAML structure
killedBy: parseOpenApiContracts — multiple contracts per operation should_produce_three_contracts_from_three_x_contracts_entries
statusReason: expected [ 200, 200, 200 ] to deeply equal [ 200, 400, 500 ]

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:337:7
 
 /** Normalize contractId to string for consistent comparison across YAML types. */
 function normalizeContractId(id: unknown): string {
-  if (id === undefined || id === null) return "";
+  if (id !== undefined || id === null) return "";
   if (typeof id === "string" || typeof id === "number" || typeof id === "boolean") {
     return String(id);
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:337:27
 
 /** Normalize contractId to string for consistent comparison across YAML types. */
 function normalizeContractId(id: unknown): string {
-  if (id === undefined || id === null) return "";
+  if (id === undefined || id !== null) return "";
   if (typeof id === "string" || typeof id === "number" || typeof id === "boolean") {
     return String(id);
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] LogicalOperator
packages/stub-server/src/openapi-parser.ts:338:7
 /** Normalize contractId to string for consistent comparison across YAML types. */
 function normalizeContractId(id: unknown): string {
   if (id === undefined || id === null) return "";
-  if (typeof id === "string" || typeof id === "number" || typeof id === "boolean") {
+  if ((typeof id === "string" || typeof id === "number") && typeof id === "boolean") {
     return String(id);
   }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1

[Killed] EqualityOperator
packages/stub-server/src/openapi-parser.ts:338:33
 /** Normalize contractId to string for consistent comparison across YAML types. */
 function normalizeContractId(id: unknown): string {
   if (id === undefined || id === null) return "";
-  if (typeof id === "string" || typeof id === "number" || typeof id === "boolean") {
+  if (typeof id === "string" || typeof id !== "number" || typeof id === "boolean") {
     return String(id);
   }
killedBy: loadFromDirectory openapi format should_load_openapi_yaml_alongside_scc_yaml
statusReason: expected [ { name: 'scc-contract.yaml', …(2) } ] to have a length of 3 but got 1
